## Plan for org_account/sre_bot
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.sre_bot_policy will be created
  + resource "aws_iam_policy" "sre_bot_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "sre_bot_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "organizations:ListAccounts"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ReadOrgAccounts"
                    },
                  + {
                      + Action   = [
                          + "trustedadvisor:ListRoots",
                          + "trustedadvisor:ListOrganizationalUnitsForParent",
                          + "trustedadvisor:ListAccountsForParent",
                          + "trustedadvisor:DescribeServiceMetadata",
                          + "trustedadvisor:DescribeReports",
                          + "trustedadvisor:DescribeOrganizationAccounts",
                          + "trustedadvisor:DescribeOrganization",
                          + "trustedadvisor:DescribeChecks",
                          + "trustedadvisor:DescribeCheckSummaries",
                          + "trustedadvisor:DescribeAccountAccess",
                          + "trustedadvisor:DescribeAccount",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ReadTrustedAdvisor"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.sre_bot will be created
  + resource "aws_iam_role" "sre_bot" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::659087519042:user/MaxNeuvians",
                              + "arn:aws:iam::283582579564:role/sre-bot-ecs-role",
                            ]
                        }
                      + Sid       = "AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sre_bot_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.sre_bot will be created
  + resource "aws_iam_role_policy_attachment" "sre_bot" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sre_bot_role"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
